//---------------------------------------
// HPバー
//---------------------------------------
// 作成者:高野
// 作成日:2019.07.14
//--------------------------------------
// 更新履歴
// 2019.07.17 作成
//--------------------------------------
// 仕様
// 子オブジェクトに必要なもの
// ・Mask
// ・1:ダメージを受けたときにHpバーの色が変わるやつ
// ・2:Hpバーの緑のところ
// ・3:ブロックした時に色が変わるところ
// ・4:ダメージの赤
// ・5:一番後ろのbackground
//----------------------------------------
// MEMO
// 参照は手動です
//----------------------------------------
using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;
