//---------------------------------------------------------------
//  攻撃技のパラメータ
//---------------------------------------------------------------
//  作成者:高野
//  作成日:2019.05.01
//----------------------------------------------------
//  更新履歴
//  2019.05.01  :   攻撃技の（予想される）パラメータを構造体にまとめた    by takano
//-----------------------------------------------------
//  仕様
//  CommandSystemが使う
//-----------------------------------------------------
//  MEMO
//  アニメーションのデータも入れたい
//----------------------------------------------------

[System.Serializable]
public class AttackParameter
{
    //この攻撃の名前
    public string attackName;
    //この攻撃の発動コマンド
    public string command;
    //この攻撃のコマンドの入力受付時間(フレーム?)
    public int validInputFrame;
    //この攻撃のコマンドの発動受付時間
    public int validInvFrame;
    //この攻撃にかかる時間(sec)
    public int interval;
    ////この技がインターバル中か（インターバル中だとTrue）
    //public bool nowInterval;
    ////アニメーションのデータ(仮)
    ////AnimeFlag
    //AttackParameter(){nowInterval = false;}
}
